app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "artists"."id" FROM "artists"
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      if Artist.find_by(id: params[:artist_id])
        @songs = Artist.find(params[:artist_id]).songs
      else
        flash[:alert] = "Artist not found"
        redirect_to artists_path
      end
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  1 AS one FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "songs"."id" FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
---
  def show
    @song = Song.find_by(id: params[:id])
    if params[:artist_id]
      @artist = Artist.find(params[:artist_id])
      if !@artist.songs.include?(@song)